# SubwallOfStackedWallDeleted Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..SubwallOfStackedWallDeleted Property
BuiltInFailures..::..WallFailures Class See Also
---
This stacked wall will be deleted because a subwall could not be created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SubwallOfStackedWallDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SubwallOfStackedWallDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SubwallOfStackedWallDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace